{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "564b1cb6-c9ab-4387-abd5-bf3c7835e657",
   "metadata": {},
   "outputs": [],
   "source": [
    "from dotenv import load_dotenv\n",
    "load_dotenv()\n",
    "\n",
    "# TODO: Add Age Logic as Question and Tag\n",
    "\n",
    "from import_neo.base import BaseNeoImporter\n",
    "from import_neo.base_api import API2NeoImporter"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b311d97a-5884-4a9a-9339-3843932540bb",
   "metadata": {},
   "source": [
    "## Make sure to run Local Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "72b52fc7-5c19-4cc9-9a50-d837bfd79cc4",
   "metadata": {},
   "source": [
    "```shell\n",
    "docker-compose up -d --build\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "c01f1a2d-2b18-41f5-8df2-9fc84366af6f",
   "metadata": {},
   "outputs": [],
   "source": [
    "# changes this to run DigitalOcean Spaces or MHP-API\n",
    "RUN_SPACES = True"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "20e9fdd1-b9a6-4792-8ee3-383ea70a3508",
   "metadata": {},
   "outputs": [],
   "source": [
    "neo = BaseNeoImporter(node_type='Services')\n",
    "with neo.driver.session() as session:\n",
    "    session.run(\"\"\"MATCH (n) DETACH DELETE n;\"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9c83e7a5-d3ec-4046-9979-f33d50aca016",
   "metadata": {},
   "source": [
    "# Use Backup in Digital Ocean Spaces"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "b5cee614-20d7-4e7c-a051-e8b160642275",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Services Data \n",
      "\n",
      "{'tag_nodes': 31, 'nodes': 188, 'rel': 336}\n",
      "{'name': 'S. AZ Gender Alliance', 'phone': 5204777096, 'address': '2030 EAST BROADWAY', 'general_topic': 'LGBTQ', 'tags': ['LGBTQ'], 'city': 'Tuscon', 'state': 'AZ', 'lat': 32.2210873, 'lon': -110.94121, 'zip_code': 85719, 'web_site': 'http://www.sagatucson.org/', 'days': None, 'hours': None, 'id': '632259bda6904810a4353d29', 'mongo_id': '632259bda6904810a4353d29', 'main_tag': 'LGBTQ'}\n",
      "\n",
      "Questions Data \n",
      "\n",
      "{'tag_nodes': 30, 'nodes': 28, 'rel': 106}\n",
      "{'id': 1, 'question': 'Is anyone scaring, threatening or hurting you or your children?', 'tags': ['Domestic Violence', 'Shelter', 'Family'], 'main_tag': 'Family', 'mongo_id': 1, 'name': 'Is anyone scaring, threatening or hurting you or your children?'}\n"
     ]
    }
   ],
   "source": [
    "if RUN_SPACES:\n",
    "    impo_services = BaseNeoImporter(node_type='Services', space='api')\n",
    "    print('Services Data \\n')\n",
    "    impo_services.run()\n",
    "    print(impo_services.data[0])\n",
    "    \n",
    "    \n",
    "    impo_q = BaseNeoImporter(node_type='Questions', space='api')\n",
    "    print('\\nQuestions Data \\n')\n",
    "    impo_q.run()\n",
    "    print(impo_q.data[0])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ca3b7af3-c507-4ace-9de0-5c8e0a8c61eb",
   "metadata": {},
   "source": [
    "## Use API to Import to Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "8bb0ecaa-1a54-4cf7-bc8f-5c12e955dee8",
   "metadata": {},
   "outputs": [],
   "source": [
    "if not RUN_SPACES:\n",
    "    # note mhp docker services must be running locally which will be a port 80\n",
    "    # if not use production server: https://mhpportal.app\n",
    "    api_path = 'https://mhpportal.app'\n",
    "    print(f'Using API: {api_path}')\n",
    "    q = API2NeoImporter(node_type='Questions', api_path=api_path)\n",
    "    print('Questions Data \\n')\n",
    "    q.run()\n",
    "    print(q.data[0])\n",
    "    print(q.tags)\n",
    "    \n",
    "    s = API2NeoImporter(node_type='Services', api_path=api_path)\n",
    "    print('\\nServices Data \\n')\n",
    "    s.run()\n",
    "    print(s.data[0])\n",
    "    print(s.tags)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "eb763a89-02cf-4c3f-bf34-a8c2b4a44a48",
   "metadata": {},
   "outputs": [],
   "source": [
    "# QA wrong node type\n",
    "# impo_services = BaseNeoImporter(node_type='Service')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aec97d25-12e0-47b9-a6f6-4fc6a4b840ba",
   "metadata": {},
   "source": [
    "# Cypher Queries\n",
    "<img src=\"static/graph.png\">\n",
    "\n",
    "* https://neo4j.com/docs/graph-data-science/current/algorithms/node-similarity/\n",
    "* https://neo4j.com/docs/graph-data-science/current/algorithms/knn/\n",
    "* https://neo4j.com/docs/graph-data-science/current/algorithms/bfs/\n",
    "* https://neo4j.com/docs/graph-data-science/current/machine-learning/linkprediction-pipelines/link-prediction/\n",
    "\n",
    "## Show all relationships \n",
    "<hr>\n",
    "\n",
    "```cypher\n",
    "MATCH p=()-[r:TAGGED]-() RETURN p;\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "009f2322-fb73-427c-989a-f9f19936f28a",
   "metadata": {},
   "source": [
    "## Get Node Similiarties\n",
    "<hr>\n",
    "\n",
    "```cypher\n",
    "CALL gds.graph.project(\n",
    "    'myGraph',\n",
    "    ['Tags', 'Services', 'Questions'],\n",
    "    {\n",
    "        TAGGED: {\n",
    "        }\n",
    "    }\n",
    ");\n",
    "```\n",
    "\n",
    "\n",
    "```cypher\n",
    "CALL gds.nodeSimilarity.write('myGraph', {\n",
    "    writeRelationshipType: 'SIMILAR',\n",
    "    writeProperty: 'score'\n",
    "})\n",
    "YIELD nodesCompared, relationshipsWritten;\n",
    "```\n",
    "\n",
    "\n",
    "```cypher\n",
    "MATCH p=()-[r:SIMILAR]-() WHERE r.score > 0.75 RETURN p;\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bf297f39-93d3-42be-8a53-35da319be9d2",
   "metadata": {},
   "source": [
    "## Link Prediction\n",
    "<hr>\n",
    "\n",
    "```cypher\n",
    "\n",
    "CALL gds.beta.pipeline.linkPrediction.create('pipe');\n",
    "\n",
    "                                             \n",
    "CALL gds.beta.pipeline.linkPrediction.configureSplit('pipe', {\n",
    "  testFraction: 0.25,\n",
    "  trainFraction: 0.6,\n",
    "  validationFolds: 3\n",
    "})\n",
    "YIELD splitConfig;\n",
    "\n",
    "\n",
    "CALL gds.alpha.pipeline.linkPrediction.addMLP('pipe',\n",
    "{hiddenLayerSizes: [4, 2], penalty: 1, patience: 2})\n",
    "YIELD parameterSpace;\n",
    "\n",
    "\n",
    "CALL gds.alpha.pipeline.linkPrediction.configureAutoTuning('pipe', {\n",
    "  maxTrials: 2\n",
    "}) YIELD autoTuningConfig;\n",
    "\n",
    "\n",
    "\n",
    "CALL gds.graph.project(\n",
    "  'testGraph',\n",
    "  {\n",
    "    Services: {\n",
    "      properties: ['created']\n",
    "    }\n",
    "  },\n",
    "  {\n",
    "    TAGGED: {\n",
    "      orientation: 'UNDIRECTED'\n",
    "    }\n",
    "  }\n",
    ");\n",
    "\n",
    "\n",
    "CALL gds.beta.pipeline.linkPrediction.train('testGraph', {\n",
    "  pipeline: 'pipe',\n",
    "  modelName: 'lp-pipeline-model',\n",
    "  metrics: ['AUCPR', 'OUT_OF_BAG_ERROR'],\n",
    "  targetRelationshipType: 'TAGGED',\n",
    "  randomSeed: 73\n",
    "}) YIELD modelInfo, modelSelectionStats\n",
    "RETURN\n",
    "  modelInfo.bestParameters AS winningModel,\n",
    "  modelInfo.metrics.AUCPR.train.avg AS avgTrainScore,\n",
    "  modelInfo.metrics.AUCPR.outerTrain AS outerTrainScore,\n",
    "  modelInfo.metrics.AUCPR.test AS testScore,\n",
    "  [cand IN modelSelectionStats.modelCandidates | cand.metrics.AUCPR.validation.avg] AS validationScores;\n",
    "    \n",
    "    \n",
    "CALL gds.beta.pipeline.linkPrediction.predict.stream('testGraph', {\n",
    "  modelName: 'lp-pipeline-model',\n",
    "  topN: 5,\n",
    "  threshold: 0.5\n",
    "})\n",
    " YIELD node1, node2, probability\n",
    " RETURN gds.util.asNode(node1).name AS person1, gds.util.asNode(node2).name AS person2, probability\n",
    " ORDER BY probability DESC, person1;\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0a98b225-334c-473d-98a4-41d980176a09",
   "metadata": {},
   "source": [
    "## Get Services not tied to Question\n",
    "<hr>\n",
    "\n",
    "### Get Services not tied to Question\n",
    "\n",
    "```cypher\n",
    "MATCH (n:Services)-[:TAGGED]->(n1:Tags) \n",
    "WHERE NOT (n1)-[:TAGGED]-(:Questions) \n",
    "// Young Adult Resources is tied by Age Question\n",
    "      AND n1.name <> 'Young Adult Resources' \n",
    "      AND NOT (n)-[:TAGGED]-(n1)-[:TAGGED]-(:Questions)\n",
    "RETURN n.id as service_id, n.name as service, COLLECT(n1.name) as tags \n",
    "ORDER BY tags;\n",
    "```\n",
    "\n",
    "\n",
    "### Get Tags not tied to Question\n",
    "\n",
    "```cypher\n",
    "MATCH (n:Services)-[:TAGGED]->(n1:Tags) \n",
    "WHERE NOT (n1)-[:TAGGED]-(:Questions) \n",
    "// Young Adult Resources is tied by Age Question\n",
    "      AND n1.name <> 'Young Adult Resources' \n",
    "WITH n1.name as tags \n",
    "RETURN DISTINCT tags as tag\n",
    "ORDER BY tag;\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "5820ee7f-f72b-4559-b832-119edf499113",
   "metadata": {},
   "outputs": [],
   "source": [
    "neo = BaseNeoImporter(node_type='Services')\n",
    "\n",
    "with neo.driver.session() as session:\n",
    "    data = session.run(\"\"\"\n",
    "        MATCH (n:Services)-[:TAGGED]->(n1:Tags) \n",
    "    WHERE NOT (n1)-[:TAGGED]-(:Questions) \n",
    "    // Young Adult Resources is tied by Age Question\n",
    "          AND n1.name <> 'Young Adult Resources' \n",
    "          AND NOT (n)-[:TAGGED]-(n1)-[:TAGGED]-(:Questions)\n",
    "    RETURN n.id as service_id, n.name as service, COLLECT(n1.name) as tags \n",
    "    ORDER BY tags;\n",
    "    \"\"\")\n",
    "    df = data.to_df()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "6eebfe17-ad42-4a2b-859f-7545402346d4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'service_id': '632259bda6904810a4353dc2',\n",
       "  'service': 'COPE Community Services, Inc.',\n",
       "  'tags': ['Addiction Resources']},\n",
       " {'service_id': '632259bda6904810a4353dc1',\n",
       "  'service': 'COPE Community Services',\n",
       "  'tags': ['Addiction Resources']},\n",
       " {'service_id': '632259bda6904810a4353dc0',\n",
       "  'service': 'Cope Behavioral Services',\n",
       "  'tags': ['Addiction Resources']},\n",
       " {'service_id': '632259bda6904810a4353dbf',\n",
       "  'service': 'COPE Community Services',\n",
       "  'tags': ['Addiction Resources']},\n",
       " {'service_id': '632259bda6904810a4353dbe',\n",
       "  'service': 'COPE Community Services, Inc.',\n",
       "  'tags': ['Addiction Resources']},\n",
       " {'service_id': '632259bda6904810a4353dbd',\n",
       "  'service': 'Cope Behavioral Services',\n",
       "  'tags': ['Addiction Resources']},\n",
       " {'service_id': '632259bda6904810a4353dbc',\n",
       "  'service': 'COPE Community Services, Inc.',\n",
       "  'tags': ['Addiction Resources']},\n",
       " {'service_id': '632259bda6904810a4353dbb',\n",
       "  'service': 'COPE Community Services, Inc. -Youth And Family Services',\n",
       "  'tags': ['Addiction Resources']},\n",
       " {'service_id': '632259bda6904810a4353db8',\n",
       "  'service': 'CODAC Health, Recovery & Wellness- Cobblestone Court',\n",
       "  'tags': ['Addiction Resources']},\n",
       " {'service_id': '632259bda6904810a4353db7',\n",
       "  'service': 'CODAC Health, Recovery & Wellness- Country Club',\n",
       "  'tags': ['Addiction Resources']},\n",
       " {'service_id': '632259bda6904810a4353db6',\n",
       "  'service': 'CODAC Health, Recovery & Wellness- Alvernon',\n",
       "  'tags': ['Addiction Resources']},\n",
       " {'service_id': '632259bda6904810a4353db5',\n",
       "  'service': 'CODAC Health, Recovery & Wellness- Medication Addiction Treatment',\n",
       "  'tags': ['Addiction Resources']},\n",
       " {'service_id': '632259bda6904810a4353de0',\n",
       "  'service': 'Narcotics Anonymous',\n",
       "  'tags': ['Addiction Resources', 'Substance Abuse']},\n",
       " {'service_id': '632259bda6904810a4353ddf',\n",
       "  'service': \"Arizona Smokers' Helpline\",\n",
       "  'tags': ['Addiction Resources', 'Substance Abuse']},\n",
       " {'service_id': '632259bda6904810a4353dde',\n",
       "  'service': 'Al-Anon',\n",
       "  'tags': ['Addiction Resources', 'Substance Abuse']},\n",
       " {'service_id': '632259bda6904810a4353ddd',\n",
       "  'service': 'Alcoholics Anonymous',\n",
       "  'tags': ['Addiction Resources', 'Substance Abuse']},\n",
       " {'service_id': '632259bda6904810a4353d83',\n",
       "  'service': 'El Rio Community Health Center-Congress Dental Center',\n",
       "  'tags': ['Dental', 'Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d82',\n",
       "  'service': 'El Rio Community Health Center-Northwest Dental ',\n",
       "  'tags': ['Dental', 'Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d81',\n",
       "  'service': 'El Rio Southwest Dental ',\n",
       "  'tags': ['Dental', 'Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d7d',\n",
       "  'service': 'El Rio-Congress Dental Center',\n",
       "  'tags': ['Dental', 'Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d7c',\n",
       "  'service': 'El Rio Community Center-Northwest Dental',\n",
       "  'tags': ['Dental', 'Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d92',\n",
       "  'service': 'Tucson Interfaith HIV/AIDS Network',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d91',\n",
       "  'service': 'Planned Parenthood-Southern Arizona Regional Health Center',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d90',\n",
       "  'service': 'Pima County Health Department ',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d8f',\n",
       "  'service': 'Pima County Public Health ',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d8e',\n",
       "  'service': 'Pima County Health Department',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d8d',\n",
       "  'service': 'Pima County Health Department- North Office',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d8c',\n",
       "  'service': 'Casa De Los Ninos ',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d8b',\n",
       "  'service': 'New Spirit Lutheran Church ',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d8a',\n",
       "  'service': 'El Rio OBGYN Associates ',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d89',\n",
       "  'service': \"El Rio-St. Elizabeth's Health Center\",\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d88',\n",
       "  'service': 'El Rio-Pascua Yaqui ',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d87',\n",
       "  'service': 'El Rio-Health On University ',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d86',\n",
       "  'service': 'El Rio-Health On Broadway ',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d85',\n",
       "  'service': 'El Rio Community Health Center ',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d84',\n",
       "  'service': \"El Rio Birth & Women's \",\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d80',\n",
       "  'service': 'El Rio Southeast',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d7f',\n",
       "  'service': 'El Rio Community Health Center',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d7e',\n",
       "  'service': 'El Rio Southwest Clinic ',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d7b',\n",
       "  'service': 'El Rio Community Health Center',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d7a',\n",
       "  'service': 'El Rio Health ',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d79',\n",
       "  'service': 'El Rio Community Health Center',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d78',\n",
       "  'service': 'El Rio Community Health Center Administration',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d77',\n",
       "  'service': 'Diaper Bank of Southern Arizona',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d72',\n",
       "  'service': 'Southern Arizona Aids Foundation',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d32',\n",
       "  'service': 'UA Mobile Health Clinic',\n",
       "  'tags': ['Health Care Resources']},\n",
       " {'service_id': '632259bda6904810a4353d9d',\n",
       "  'service': \"UA Worker's Rights Clinic\",\n",
       "  'tags': ['Immigrant/Refugee Resources']},\n",
       " {'service_id': '632259bda6904810a4353d9c',\n",
       "  'service': 'UA Immigration Law Clinic',\n",
       "  'tags': ['Immigrant/Refugee Resources']},\n",
       " {'service_id': '632259bda6904810a4353d9b',\n",
       "  'service': 'Refugee Mobile App ',\n",
       "  'tags': ['Immigrant/Refugee Resources']},\n",
       " {'service_id': '632259bda6904810a4353d9a',\n",
       "  'service': 'Merciful Refugee and Immigrant Services',\n",
       "  'tags': ['Immigrant/Refugee Resources']},\n",
       " {'service_id': '632259bda6904810a4353d99',\n",
       "  'service': 'Lutheran Social Services of the Southwest',\n",
       "  'tags': ['Immigrant/Refugee Resources']},\n",
       " {'service_id': '632259bda6904810a4353d98',\n",
       "  'service': 'Iskashitaa Refugee Network',\n",
       "  'tags': ['Immigrant/Refugee Resources']},\n",
       " {'service_id': '632259bda6904810a4353d97',\n",
       "  'service': 'International Rescue Committee',\n",
       "  'tags': ['Immigrant/Refugee Resources']},\n",
       " {'service_id': '632259bda6904810a4353d96',\n",
       "  'service': 'Florence Immigrant & Refugee Rights Project',\n",
       "  'tags': ['Immigrant/Refugee Resources']},\n",
       " {'service_id': '632259bda6904810a4353d95',\n",
       "  'service': 'Derechos Humanos',\n",
       "  'tags': ['Immigrant/Refugee Resources']},\n",
       " {'service_id': '632259bda6904810a4353d94',\n",
       "  'service': 'Catholic Community Services Southern',\n",
       "  'tags': ['Immigrant/Refugee Resources']},\n",
       " {'service_id': '632259bda6904810a4353d93',\n",
       "  'service': 'Catholic Community Services',\n",
       "  'tags': ['Immigrant/Refugee Resources']},\n",
       " {'service_id': '632259bda6904810a4353dd1',\n",
       "  'service': 'Medical Assistance Tool ',\n",
       "  'tags': ['Prescription Medication Assistance']},\n",
       " {'service_id': '632259bda6904810a4353dd0',\n",
       "  'service': 'Discount ($4) RX Plans',\n",
       "  'tags': ['Prescription Medication Assistance']},\n",
       " {'service_id': '632259bda6904810a4353dcf',\n",
       "  'service': 'Care Mark Card',\n",
       "  'tags': ['Prescription Medication Assistance']},\n",
       " {'service_id': '632259bda6904810a4353dce',\n",
       "  'service': 'AZ Copper Card',\n",
       "  'tags': ['Prescription Medication Assistance']},\n",
       " {'service_id': '632259bda6904810a4353de4',\n",
       "  'service': 'TEP - Lifeline Discount Program',\n",
       "  'tags': ['Utility Assistance']},\n",
       " {'service_id': '632259bda6904810a4353de3',\n",
       "  'service': 'Salvation Army Utilities/Rent',\n",
       "  'tags': ['Utility Assistance']},\n",
       " {'service_id': '632259bda6904810a4353de2',\n",
       "  'service': 'Project PPEP',\n",
       "  'tags': ['Utility Assistance']},\n",
       " {'service_id': '632259bda6904810a4353de1',\n",
       "  'service': 'Pima County Community Action Agency',\n",
       "  'tags': ['Utility Assistance']}]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.to_dict(orient='records')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "bfa76590-947d-4121-8347-461ed6ef6cce",
   "metadata": {},
   "outputs": [],
   "source": [
    "with neo.driver.session() as session:\n",
    "    data = session.run(\"\"\"\n",
    "        MATCH (n:Services)-[:TAGGED]->(n1:Tags) \n",
    "        WHERE NOT (n1)-[:TAGGED]-(:Questions) \n",
    "        // Young Adult Resources is tied by Age Question\n",
    "              AND n1.name <> 'Young Adult Resources' \n",
    "        WITH n1.name as tags \n",
    "        RETURN DISTINCT tags as tag\n",
    "        ORDER BY tag;\n",
    "        \"\"\")\n",
    "    tag = data.values()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "eb416924-aab1-4115-93ef-2b985cf89300",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Addiction Resources',\n",
       " 'Dental',\n",
       " 'Health Care Resources',\n",
       " 'Immigrant/Refugee Resources',\n",
       " 'Prescription Medication Assistance',\n",
       " 'Substance Abuse',\n",
       " 'Utility Assistance']"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "[elem for sublist in tag for elem in sublist]"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "47e171b1-08a2-43e8-817b-4473d66881c8",
   "metadata": {},
   "source": [
    "# Get User Data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "cbf300e8-9679-4695-af56-52a78a23f5d5",
   "metadata": {},
   "outputs": [],
   "source": [
    "zip_codes_url = 'https://mhpportal.app/api/v1/platform/zip_codes'\n",
    "data_zip_url = 'https://mhpportal.app/api/v1/platform/data/%s'\n",
    "\n",
    "import requests\n",
    "\n",
    "resp = requests.get(zip_codes_url)\n",
    "z_c = resp.json()\n",
    "z_c\n",
    "\n",
    "json_data = []\n",
    "for z in z_c:\n",
    "    resp = requests.get(data_zip_url % z['id'])\n",
    "    json_data = json_data + resp.json()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "acbef505-d255-4bca-acdc-dcff2defa3c9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'dob': 1994,\n",
       " 'zip_code': 85732,\n",
       " 'answers': [0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0,\n",
       "  0],\n",
       " 'top_services': ['632259bda6904810a4353d4b',\n",
       "  '632259bda6904810a4353d4e',\n",
       "  '632259bda6904810a4353d4d',\n",
       "  '632259bda6904810a4353de5',\n",
       "  '632259bda6904810a4353d4c',\n",
       "  '632259bda6904810a4353d60',\n",
       "  '632259bda6904810a4353d48',\n",
       "  '632259bda6904810a4353d5e',\n",
       "  '632259bda6904810a4353d61',\n",
       "  '632259bda6904810a4353d50',\n",
       "  '632259bda6904810a4353d4a',\n",
       "  '632259bda6904810a4353d2f',\n",
       "  '632259bda6904810a4353d47',\n",
       "  '632259bda6904810a4353d2a',\n",
       "  '632259bda6904810a4353d58'],\n",
       " 'time': '2023-01-19T03:27:56.937000',\n",
       " 'name': '4fadbd1eaac34ca88c4c9d69dd249b87',\n",
       " 'id': '63c8b8bc6abf8b7271145307'}"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "json_data[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "affa010d-5801-49b4-9320-e3ec77bf31c4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'nodes': 19, 'rel': 237}\n"
     ]
    }
   ],
   "source": [
    "from import_neo.analytics import Analytics2NeoImporter\n",
    "\n",
    "a = Analytics2NeoImporter()\n",
    "a.run()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "17081e3e-7b7e-4637-85be-2bc16bdde5fc",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
